# Exercise 10

### Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.

In [ ]:
student_data.groupby('school_code').agg({
    'age': ['min', 'mean', 'max']
})

            age
            min  mean max
school_code
s001         12  12.5  13
s002         12  13.0  14
s003         13  13.0  13
s004         12  12.0  12